#+title:  文学编程
#+html_head: <link rel="stylesheet" type="text/css" href="../assets/themes/havee/css/style.css" />

: 文学编程希望能做到写的程序适于阅读，文档描述能遵循问题的逻辑顺序，同时不受制于编程语言的缺陷

支持LaTex

- Unicode References :: for instance, \alpha, \beta and \gamma.
- Subscripts :: like Hydrogen atoms, H_2, and Water, H_{2}O.
- Superscripts :: The mass of the sun is 1.989 x 10^30 kg.
- Embedded Equations :: Surrounded with either single =$=, like $a^2=b$,
or escaped parenthesis, like: \( b=\frac{1}{2} \)
- Separated equations :: Either in double =$$= or escaped brackets, like
this: $$ a=\frac{1}{2}\sqrt{2} $$ or this: \[ a=-\sqrt{2} \] or this:
\begin{equation}
x=\sqrt{b}
\end{equation}

#+OPTIONS: tex:t


#+begin_src emacs-lisp
  (progn
    (directory-files ".")
    (print "hello"))

#+end_src

#+RESULTS:
: hello


- 按下 =C-c C-c= 执行命令
- 按下 =C-c '(单引号)= 可以以指定的mode来编辑这段代码 (利用paredit插件来编写代码)

  
** 例子：dir参数
该参数会设置代码块执行的工作目录:
#+begin_src shell :dir /etc
  ls
#+end_src

该参数可以通过Tramp实现在远程服务器上执行代码

#+begin_src shell :exports both
hostname -f
#+end_src

#+RESULTS:
: WSSHA126093G1J1.local

#+begin_src sh :dir /5zyx.com:
hostname -f
#+end_src

* 指定特定语言的默认头参数
:PROPERTIES:
:header-args:shell: :dir /etc
:header-args:ruby: :dir /
:END:

#+begin_src shell
ls -d $(pwd)
#+end_src

#+RESULTS:
: /private/etc

#+begin_src ruby
File.absolute_path(".")
#+end_src

#+RESULTS:
: /

注意： 有些参数智能通过 ~header-args~ 的方式设置

*** 还是代码的输出结果？

以下Ruby代码块为例，默认情况下，得到的事最后表达式的返回结果

#+begin_src ruby
  puts 'Hello World'
  5*6
#+end_src

#+RESULTS:
: 30

若将 ~:results~ 头参数的值改为 ~output~ ,则结果是程序的输出：

#+begin_src ruby :results output
  puts 'Hello World'
  5*6
#+end_src

#+RESULTS:
: Hello World

注意： sh代码块的 ~:results~ 默认值为 ~output~

** 原样输出

shell命令和日志输出比较适合原样输出，例如：

#+BEGIN_SRC sh :results verbatim :exports both :output list
   # ssh -v goblin.howardabrams.com ls mossandcrow
#+END_SRC

#+RESULTS:
OpenSSH_6.6.1, OpenSSL 1.0.1f 6 Jan 2014
debug1: Reading configuration data /etc/ssh/ssh_config
debug1: /etc/ssh/ssh_config line 19: Applying options for *
debug1: Connecting to goblin.howardabrams.com [162.243.135.186] port 22.
debug1: Connection established.
debug1: identity file /home/howard/.ssh/id_rsa type 1
debug1: identity file /home/howard/.ssh/id_rsa-cert type -1


* Session
默认情况下，每个代码块在每次运行时都会重启自己的一个解释器.通过为 ~:session~ 头参数设置一个标签值，则所有拥有同一标签的代码块在运行时都在同一个解释器中

注意：不同代码块之间可以传递值

下面例子说明每个代码块执行时都会重启自己的解释器:

#+begin_src python :session foobar
  avar = 42
#+end_src

#+RESULTS:

#+begin_src python :session foobar
  avar /2
#+end_src

#+RESULTS:
: 21


* Confusing Stuff
:PROPERTIES:
:session: stateful
:END:

#+begin_src shell :results silent
NUM_USERS=$(grep 'bash' /etc/passwd | wc -l --)
#+end_src

#+begin_src shell
echo $NUM_USERS
#+end_src

#+RESULTS:

#+begin_src ruby
21*2
#+end_src

#+RESULTS:
: 42

=警告=: 为整个section设置的 ~：session~ 参数会影响到每个代码块，而不管该代码块是哪种编程语言

** 注释
若需要与他人分享代码，可以将文档内容转换成注释：

Precede each line in the text from standard in (or file) with the 
current line number. 
See [[http://benoithamelin.tumblr.com/ruby1line][one liners]].

#+begin_src ruby :results list :tangle lineno.rb comm :comments org
  while s = gets
    puts "#{$<.file.lineno}:#{s}"
  end
#+end_src

#+RESULTS:
: - nil

#+PROPERTY: tangle lineno.rb
#+PROPERTY: comments org

=:comments= 参数指明了是否将以及如何将文档内容作为注释插入tangle出的代码，其值为org表示将文档内容作为org code来格式化再做为注释插入。
注意：只有代码块上面的内容才会作为注释插入
默认值为 =no= 意味着不插入任何注释

** Noweb
若你为某个代码块命了名，则其他代码块就可以包含该代码块了 使用 =:noweb= 参数。[fn:1] 假如有如下一个org文件：

Print the last field of each line.

#+NAME: the-script
#+begin_src ruby
puts $F.last
#+end_src

#+begin_src shell :noweb yes :tangle last-col.sh
ruby -ane '<<the-script>>'
#+end_src

#+RESULTS:
会创建一个名为 =last-col.sh= 的源代码文件,其内容为:
#+begin_src 
ruby -ane 'puts $F.last'
#+end_src

** 变量
org能够以变量的形式传递一个或多个值到你的代码块中。下面演示一个静态地设置变量的例子:

#+begin_src python :var interest=13
return 313 * (interest / 100.0)
#+end_src

#+RESULTS:
: 40.69

可以在一行或多行位置上同时定义多个变量，下面是个例子


#+HEADER: :var a=42 d=56 :var f=23
#+HEADERS: :var b=79 e=79
#+begin_src ruby :var c=3 g=2
[a,b,c,d,e,f,g]
#+end_src

#+RESULTS:
| 42 | 79 | 3 | 56 | 79 | 23 | 2 |

这样静态的设置变量的值的意义？

*** 将代码块的结果作为值传递给另一个代码块

#+NAME: twelve-primes
#+begin_src ruby
  require 'prime'
  Prime.first 12
#+end_src

#+RESULTS: twelve-primes
| 2 | 3 | 5 | 7 | 11 | 13 | 17 | 19 | 23 | 29 | 31 | 37 |

#+begin_src python :var primes=twelve-primes
return primes[-1]
#+end_src

#+RESULTS:
: 37
ruby 与python结合完成任务

*** 表格分片

我们可以只传递表格中的某一行，方法是指定一个索引编号.
#+begin_src ruby :var fifth=cool-numbers[4]
fifth
#+end_src

#+RESULTS:
| 5 | 7 | 25 | 66 | 125 | 867 |

类似方法，我们也能只传递表格中的某一列数据。下面是一个例子，其中的逗号表示任意行，后面的4则限制了只取第五列的数字

#+NAME: cubes
#+begin_src elisp :var cubes=cool-numbers[,4]
cubes
#+end_src

#+RESULTS: cubes
| 1 | 8 | 27 | 64 | 125 | 216 | 343 | 512 | 729 | 1000 |

*** Reprocessing
名为cool-numbers的表格被名为cubes的代码块所使用，然后cubes代码块的结果值又可以传递给其他代码块：

#+NAME: roots_of_list
#+begin_src python :var lst=cubes :results list
import math
return [math.sqrt(n) for n in lst]
#+end_src

#+RESULTS: roots_of_list
- 1.0
- 2.8284271247461903
- 5.196152422706632
- 8.0
- 11.180339887498949
- 14.696938456699069
- 18.520259177452136
- 22.627416997969522
- 27.0
- 31.622776601683793

** 调用代码块

可以再调用代码块时给代码块赋值

#+CALL: roots_of_list(lst='(16 144 81 61))

#+RESULTS:
- 4.0
- 12.0
- 9.0
- 7.810249675906654
  
使用其他代码块的输出结果.

#+CALL: roots_of_list(lst=cool-numbers[,2])

#+RESULTS:
- 1.0
- 2.0
- 3.0
- 4.0
- 5.0
- 6.0
- 7.0
- 8.0
- 9.0
- 10.0
  
#+NAME: cube
#+begin_src elisp :var n=0 :exports none
  (* n n n)
#+end_src

#+RESULTS: cube
: 0

#+CALL:cub[:results table](n=3)

** Library of Babel
~Library of Babel~ 是一系列可以在任意org-mode文件总调用的代码块. 就好像时Ruby中的Gem源一样, 你需要指定哪些包含有命名代码块的文件是可访问的.

按照以下步骤进行操作：
- 新建一个org文件，并添加至少一个命名了的代码块
- 按下 ~C-c C-v i~
- 选择你新建的这个org文件，表示将该文件加入babel集合中.

#+begin_src python :post take(data=*this*, only=3)
return [x * x for x in range(1,20)]
#+end_src

#+RESULTS:
| 1 | 4 | 9 | ... |

该功能在以下几种情况下很有用：
- 用于 ~:post~ 参数中处理结果
- 通过 ~#+CALL~ 语句将运算结果嵌入到行中
- 通过 ~call_XYZ()~ 语句将运算结果嵌入到行中

要想让这些文件永久性的添加到 babel library中,需要在你的Emacs初始化文件中对每个想被添加的org文件调用 ~org-babel-lob-ingest~ 函数.


